Tekla Open API Reference for Tekla Structures 2025
RebarSplice.BarPositions Property
 Value 0: Joined bars on top of each other in the case of the lap type splice. Value 1: Joined bars parallel to each other in the case of the lap type splice.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSplice.RebarSpliceBarPositionsEnum BarPositions { get; set; }
Public Property BarPositions As RebarSplice.RebarSpliceBarPositionsEnum
	Get
	Set
Property Value
Type: RebarSplice.RebarSpliceBarPositionsEnum
See Also
Reference
RebarSplice Class
Tekla.Structures.Model Namespace